Revit 2025 API
MetallicpaintFlecksType Enumeration
 The enumerated type representing the permitted values for the asset property "MetallicpaintFlecks" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum MetallicpaintFlecksType
Public Enumeration MetallicpaintFlecksType
public enum class MetallicpaintFlecksType
type MetallicpaintFlecksType
Members
Member name | Value | Description
None | 0
Enable | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace